In [1]:
import pandas as pd
import numpy as np
import datetime as dt
pd.set_option("display.max_columns",None)
pd.set_option("display.float_format",lambda x: '%.3f' % x)

df_ = pd.read_excel("online_retail_II.xlsx",sheet_name="Year 2009-2010")
df_.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom

In [78]:
df = df_.copy()
df.shape

(525461, 8)

In [79]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
dtype: int64

In [80]:
df.nunique()

Invoice        28816
StockCode       4632
Description     4681
Quantity         825
InvoiceDate    25296
Price           1606
Customer ID     4383
Country           40
dtype: int64

In [81]:
df.Description.value_counts()

Description
WHITE HANGING HEART T-LIGHT HOLDER     3549
REGENCY CAKESTAND 3 TIER               2212
STRAWBERRY CERAMIC TRINKET BOX         1843
PACK OF 72 RETRO SPOT CAKE CASES       1466
ASSORTED COLOUR BIRD ORNAMENT          1457
                                       ...
stock credited from royal yacht inc       1
VINTAGE METAL CAKE STAND CREAM            1
BLUE BAROQUE FLOCK CANDLE HOLDER          1
S/4 HEART CRYSTAL FRIDGE MAGNETS          1
dotcom email                              1
Name: count, Length: 4681, dtype: int64

In [82]:
df.groupby("Description").agg({"Quantity":"sum"})

                                     Quantity
Description
21494                                    -720
22467                                      -2
22719                                       2
  DOORMAT UNION JACK GUNS AND ROSES       179
 3 STRIPEY MICE FELTCRAFT                 690
...                                       ...
wet/smashed/unsellable                   -700
wonky bottom/broken                       -35
wrong code                               -258
wrong ctn size                           -626
wrong invc                                 70

[4681 rows x 1 columns]

In [83]:
df.groupby("Description").agg({"Quantity":"sum"}).sort_values(by="Quantity",ascending=False)

                                    Quantity
Description
WHITE HANGING HEART T-LIGHT HOLDER     57733
WORLD WAR 2 GLIDERS ASSTD DESIGNS      54698
BROCADE RING PURSE                     47647
PACK OF 72 RETRO SPOT CAKE CASES       46106
ASSORTED COLOUR BIRD ORNAMENT          44925
...                                      ...
Zebra invcing error                    -9000
ebay sales                            -13630
missing                               -15149
given away                            -20000
?                                     -25373

[4681 rows x 1 columns]

In [84]:
df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom
...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,2010-12-09 20:01:00,2.950,17530.000,United Kingdom
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,2010-12-09 20:01:00,3.750,17530.000,United Kingdom
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,2010-12-09 20:01:00,1.950,17530.000,United Kingdom

In [85]:
df["total_price"] = df["Quantity"] * df["Price"]

In [86]:
df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom,83.400
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom,100.800
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom,30.000
...,...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,2010-12-09 20:01:00,2.950,17530.000,United Kingdom,5.900
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,3.750
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,3.750
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,7.500
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,2010-12-09 20:01:00,1.950,17530.000,United Kingdom,3.900

In [87]:
df.groupby("Invoice").agg({"total_price":["mean","sum"]})

        total_price
               mean      sum
Invoice
489434       63.163  505.300
489435       36.450  145.800
489436       33.175  630.330
489437       13.511  310.750
489438      134.485 2286.240
...             ...      ...
C538121     -12.750  -12.750
C538122      -1.250   -1.250
C538123      -2.500   -7.500
C538124      -5.900  -17.700
C538164      -1.950   -1.950

[28816 rows x 2 columns]

In [88]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      2928
Quantity            0
InvoiceDate         0
Price               0
Customer ID    107927
Country             0
total_price         0
dtype: int64

In [89]:
df.dropna(inplace=True)

In [90]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID,total_price
count,417534.000,417534,417534.000,417534.000,417534.000
mean,12.759,2010-07-01 01:12:19.787609856,3.888,15360.645,19.994
min,-9360.000,2009-12-01 07:45:00,0.000,12346.000,-25111.090
25%,2.000,2010-03-26 11:26:00,1.250,13983.000,4.250
50%,4.000,2010-07-08 19:12:00,1.950,15311.000,11.250
75%,12.000,2010-10-14 14:08:00,3.750,16799.000,19.350
max,19152.000,2010-12-09 20:01:00,25111.090,18287.000,15818.400
std,101.220,NaN,71.132,1680.811,99.916

In [91]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
total_price    0
dtype: int64

In [94]:
df["Invoice"].astype(str).str.contains("C")

0         False
1         False
2         False
3         False
4         False
          ...
525456    False
525457    False
525458    False
525459    False
525460    False
Name: Invoice, Length: 417534, dtype: bool

In [95]:
df["Invoice"].str.contains("C",na=False)

0         False
1         False
2         False
3         False
4         False
          ...
525456    False
525457    False
525458    False
525459    False
525460    False
Name: Invoice, Length: 417534, dtype: bool

In [96]:
df.loc[(df["Invoice"].str.contains("C",na=False))]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
178,C489449,22087,PAPER BUNTING WHITE LACE,-12,2009-12-01 10:33:00,2.950,16321.000,Australia,-35.400
179,C489449,85206A,CREAM FELT EASTER EGG BASKET,-6,2009-12-01 10:33:00,1.650,16321.000,Australia,-9.900
180,C489449,21895,POTTING SHED SOW 'N' GROW SET,-4,2009-12-01 10:33:00,4.250,16321.000,Australia,-17.000
181,C489449,21896,POTTING SHED TWINE,-6,2009-12-01 10:33:00,2.100,16321.000,Australia,-12.600
182,C489449,22083,PAPER CHAIN KIT RETRO SPOT,-12,2009-12-01 10:33:00,2.950,16321.000,Australia,-35.400
...,...,...,...,...,...,...,...,...,...
524695,C538123,22956,36 FOIL HEART CAKE CASES,-2,2010-12-09 15:41:00,2.100,12605.000,Germany,-4.200
524696,C538124,M,Manual,-4,2010-12-09 15:43:00,0.500,15329.000,United Kingdom,-2.000
524697,C538124,22699,ROSES REGENCY TEACUP AND SAUCER,-1,2010-12-09 15:43:00,2.950,15329.000,United Kingdom,-2.950
524698,C538124,22423,REGENCY CAKESTAND 3 TIER,-1,2010-12-09 15:43:00,12.750,15329.000,United Kingdom,-12.750
525282,C538164,35004B,SET OF 3 BLACK FLYING DUCKS,-1,2010-12-09 17:32:00,1.950,14031.000,United Kingdom,-1.950

In [97]:
df["Invoice"].astype(str).str.extract('(\d+)')

             0
0       489434
1       489434
2       489434
3       489434
4       489434
...        ...
525456  538171
525457  538171
525458  538171
525459  538171
525460  538171

[417534 rows x 1 columns]

In [98]:
df["Invoice"].astype(str).str.extract('([A-Za-z]+)').isin(["C"]).sum()

0    9839
dtype: int64

In [99]:
df["Invoice"].astype(str).str.extract('([A-Za-z]+)').isin(["a"]).sum()

0    0
dtype: int64

In [100]:
df["Invoice"].str.extract('([A-Za-z]+)').isin(["C"]).sum()

0    9839
dtype: int64

In [101]:
df["Invoice"].astype(str).str.extract('([A-Za-z]+)')[0].str.contains('C',na=False)

0         False
1         False
2         False
3         False
4         False
          ...
525456    False
525457    False
525458    False
525459    False
525460    False
Name: 0, Length: 417534, dtype: bool

In [102]:
df["Invoice"][df["Invoice"][df["Invoice"].astype(str).str.extract('([A-Za-z]+)')[0].str.contains('C')]]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

na false dememiz lazım

In [ ]:
df["Invoice"][df["Invoice"].astype(str).str.extract('([A-Za-z]+)')[0].str.contains('C',na=False)]

178       C489449
179       C489449
180       C489449
181       C489449
182       C489449
           ...
524695    C538123
524696    C538124
524697    C538124
524698    C538124
525282    C538164
Name: Invoice, Length: 9839, dtype: object

In [ ]:
df.loc[df["Invoice"].str.contains("C",na=False)]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
178,C489449,22087,PAPER BUNTING WHITE LACE,-12,2009-12-01 10:33:00,2.950,16321.000,Australia,-35.400
179,C489449,85206A,CREAM FELT EASTER EGG BASKET,-6,2009-12-01 10:33:00,1.650,16321.000,Australia,-9.900
180,C489449,21895,POTTING SHED SOW 'N' GROW SET,-4,2009-12-01 10:33:00,4.250,16321.000,Australia,-17.000
181,C489449,21896,POTTING SHED TWINE,-6,2009-12-01 10:33:00,2.100,16321.000,Australia,-12.600
182,C489449,22083,PAPER CHAIN KIT RETRO SPOT,-12,2009-12-01 10:33:00,2.950,16321.000,Australia,-35.400
...,...,...,...,...,...,...,...,...,...
524695,C538123,22956,36 FOIL HEART CAKE CASES,-2,2010-12-09 15:41:00,2.100,12605.000,Germany,-4.200
524696,C538124,M,Manual,-4,2010-12-09 15:43:00,0.500,15329.000,United Kingdom,-2.000
524697,C538124,22699,ROSES REGENCY TEACUP AND SAUCER,-1,2010-12-09 15:43:00,2.950,15329.000,United Kingdom,-2.950
524698,C538124,22423,REGENCY CAKESTAND 3 TIER,-1,2010-12-09 15:43:00,12.750,15329.000,United Kingdom,-12.750
525282,C538164,35004B,SET OF 3 BLACK FLYING DUCKS,-1,2010-12-09 17:32:00,1.950,14031.000,United Kingdom,-1.950

In [103]:
df.loc[df["Description"].str.contains("PAPER")]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
44,489437,21987,PACK OF 6 SKULL PAPER CUPS,12,2009-12-01 09:08:00,0.650,15362.000,United Kingdom,7.800
45,489437,21989,PACK OF 20 SKULL PAPER NAPKINS,12,2009-12-01 09:08:00,0.850,15362.000,United Kingdom,10.200
69,489438,85183A,CHARLIE & LOLA WASTEPAPER BIN BLUE,60,2009-12-01 09:24:00,2.400,18102.000,United Kingdom,144.000
70,489438,85183B,CHARLIE & LOLA WASTEPAPER BIN FLORA,60,2009-12-01 09:24:00,2.400,18102.000,United Kingdom,144.000
136,489445,84988,SET OF 72 PINK HEART PAPER DOILIES,12,2009-12-01 09:57:00,1.450,17519.000,United Kingdom,17.400
...,...,...,...,...,...,...,...,...,...
525373,538170,22910,PAPER CHAIN KIT VINTAGE CHRISTMAS,10,2010-12-09 19:32:00,2.950,13969.000,United Kingdom,29.500
525374,538170,22086,PAPER CHAIN KIT 50'S CHRISTMAS,12,2010-12-09 19:32:00,2.950,13969.000,United Kingdom,35.400
525430,538171,21210,SET OF 72 RETROSPOT PAPER DOILIES,2,2010-12-09 20:01:00,1.450,17530.000,United Kingdom,2.900
525432,538171,21211,SET OF 72 SKULL PAPER DOILIES,1,2010-12-09 20:01:00,1.450,17530.000,United Kingdom,1.450
525440,538171,21989,PACK OF 20 SKULL PAPER NAPKINS,2,2010-12-09 20:01:00,0.850,17530.000,United Kingdom,1.700

In [104]:
df=df[~(df["Invoice"].str.contains("C",na=False))]
df

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom,83.400
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom,100.800
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom,30.000
...,...,...,...,...,...,...,...,...,...
525456,538171,22271,FELTCRAFT DOLL ROSIE,2,2010-12-09 20:01:00,2.950,17530.000,United Kingdom,5.900
525457,538171,22750,FELTCRAFT PRINCESS LOLA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,3.750
525458,538171,22751,FELTCRAFT PRINCESS OLIVIA DOLL,1,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,3.750
525459,538171,20970,PINK FLORAL FELTCRAFT SHOULDER BAG,2,2010-12-09 20:01:00,3.750,17530.000,United Kingdom,7.500
525460,538171,21931,JUMBO STORAGE BAG SUKI,2,2010-12-09 20:01:00,1.950,17530.000,United Kingdom,3.900

In [105]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID,total_price
count,407695.000,407695,407695.000,407695.000,407695.000
mean,13.587,2010-07-01 10:10:10.782177792,3.294,15368.504,21.663
min,1.000,2009-12-01 07:45:00,0.000,12346.000,0.000
25%,2.000,2010-03-26 14:01:00,1.250,13997.000,4.950
50%,5.000,2010-07-09 15:46:00,1.950,15321.000,11.900
75%,12.000,2010-10-14 17:09:00,3.750,16812.000,19.500
max,19152.000,2010-12-09 20:01:00,10953.500,18287.000,15818.400
std,96.842,NaN,34.757,1679.796,77.147

In [106]:
today_date = dt.datetime(2010,12,11)

In [107]:
df["InvoiceDate"].max()

Timestamp('2010-12-09 20:01:00')

In [108]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 407695 entries, 0 to 525460
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      407695 non-null  object
 1   StockCode    407695 non-null  object
 2   Description  407695 non-null  object
 3   Quantity     407695 non-null  int64
 4   InvoiceDate  407695 non-null  datetime64[ns]
 5   Price        407695 non-null  float64
 6   Customer ID  407695 non-null  float64
 7   Country      407695 non-null  object
 8   total_price  407695 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(4)
memory usage: 31.1+ MB

In [110]:
rfm=df.groupby("Customer ID").agg({"InvoiceDate":lambda InvoiceDate: (today_date - InvoiceDate.max()).days,
                               "Invoice":lambda Invoice: Invoice.nunique(),
                               "total_price": lambda total_price: total_price.sum()});rfm

             InvoiceDate  Invoice  total_price
Customer ID
12346.000            165       11      372.860
12347.000              3        2     1323.320
12348.000             74        1      222.160
12349.000             43        3     2671.140
12351.000             11        1      300.930
...                  ...      ...          ...
18283.000             18        6      641.770
18284.000             67        1      461.680
18285.000            296        1      427.000
18286.000            112        2     1296.430
18287.000             18        4     2345.710

[4314 rows x 3 columns]

In [111]:
rfm.columns = ["recency","frequency","monetary"]
rfm

             recency  frequency  monetary
Customer ID
12346.000        165         11   372.860
12347.000          3          2  1323.320
12348.000         74          1   222.160
12349.000         43          3  2671.140
12351.000         11          1   300.930
...              ...        ...       ...
18283.000         18          6   641.770
18284.000         67          1   461.680
18285.000        296          1   427.000
18286.000        112          2  1296.430
18287.000         18          4  2345.710

[4314 rows x 3 columns]

In [112]:
rfm.describe()

       recency  frequency   monetary
count 4314.000   4314.000   4314.000
mean    91.270      4.454   2047.289
std     96.944      8.169   8912.523
min      1.000      1.000      0.000
25%     18.000      1.000    307.950
50%     53.000      2.000    705.550
75%    136.000      5.000   1722.802
max    374.000    205.000 349164.350

In [114]:
rfm = rfm[rfm["monetary"]>0]
rfm.describe()

       recency  frequency   monetary
count 4312.000   4312.000   4312.000
mean    91.173      4.456   2048.238
std     96.861      8.170   8914.481
min      1.000      1.000      2.950
25%     18.000      1.000    307.988
50%     53.000      2.000    706.020
75%    136.000      5.000   1723.142
max    374.000    205.000 349164.350

In [115]:
rfm.shape

(4312, 3)

In [117]:
rfm.loc[:,"recency_score"] =pd.qcut(rfm["recency"],5,labels=[5,4,3,2,1])

In [118]:
rfm

             recency  frequency  monetary recency_score
Customer ID
12346.000        165         11   372.860             2
12347.000          3          2  1323.320             5
12348.000         74          1   222.160             2
12349.000         43          3  2671.140             3
12351.000         11          1   300.930             5
...              ...        ...       ...           ...
18283.000         18          6   641.770             4
18284.000         67          1   461.680             3
18285.000        296          1   427.000             1
18286.000        112          2  1296.430             2
18287.000         18          4  2345.710             4

[4312 rows x 4 columns]

In [120]:
rfm.loc[:,"monetary_score"] =pd.qcut(rfm["monetary"],5,labels=[1,2,3,4,5])
rfm

             recency  frequency  monetary recency_score monetary_score
Customer ID
12346.000        165         11   372.860             2              2
12347.000          3          2  1323.320             5              4
12348.000         74          1   222.160             2              1
12349.000         43          3  2671.140             3              5
12351.000         11          1   300.930             5              2
...              ...        ...       ...           ...            ...
18283.000         18          6   641.770             4              3
18284.000         67          1   461.680             3              2
18285.000        296          1   427.000             1              2
18286.000        112          2  1296.430             2              4
18287.000         18          4  2345.710             4              5

[4312 rows x 5 columns]

In [121]:
pd.qcut(rfm["frequency"],5,labels=[1,2,3,4,5])

ValueError: Bin edges must be unique: array([  1.,   1.,   2.,   3.,   6., 205.]).
You can drop duplicate edges by setting the 'duplicates' kwarg

In [122]:
rfm.frequency.value_counts()

frequency
1      1419
2       810
3       525
4       378
5       238
       ...
42        1
41        1
144       1
49        1
89        1
Name: count, Length: 64, dtype: int64

In [2]:
import pandas as pd
df = pd.DataFrame({"a":["oskar","oskar","oskar","bey","bey"],
                  "b":[12,12,5,10,10]})
df

       a   b
0  oskar  12
1  oskar  12
2  oskar   5
3    bey  10
4    bey  10

In [4]:
df.a.value_counts()

a
oskar    3
bey      2
Name: count, dtype: int64

In [3]:
df.groupby("a").b.sum()

a
bey      20
oskar    29
Name: b, dtype: int64

In [7]:
df.agg({"a":lambda x:x.nunique()})

a    2
dtype: int64

               b
count   5.000000
mean    9.800000
std     2.863564
min     5.000000
25%    10.000000
50%    10.000000
75%    12.000000
max    12.000000